In [2]:
import sqlite3
from sqlite3 import Error
import pandas as pd
import matplotlib.pyplot as plt
from Rover_Exercise_Guy import create_connection

## First, connect to the database:

In [8]:
conn = create_connection('db1.sqlite3')

#### Select all the table names and show them:

In [9]:
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('sqlite_sequence',), ('pets_pet',), ('conversations_conversation_pets',), ('conversations_review',), ('conversations_message',), ('conversations_conversation',), ('people_person',), ('people_testsegmentation',), ('services_service',)]

In [12]:
query = cursor.execute("""SELECT * from pets_pet""")

### Using Pandas:

In [96]:
df_users = pd.read_csv('csvs/people_person.csv')

Look at the datatypes in the database:

In [97]:
df_users.dtypes

id               int64
first_name      object
last_name       object
email           object
channel         object
date_joined     object
photo           object
fee            float64
gender          object
dtype: object

In [98]:
df_users.head()

,id,first_name,last_name,email,channel,date_joined,photo,fee,gender
0,1,Leanora,Allcock,leanora.allcock635@hotmail.com,NaN,2016-08-02 14:59:15.095591,https://placekitten.com/242/269,0.0,f
1,2,Elroy,Blanding,elroy.blanding510@yahoo.com,NaN,2016-08-02 18:15:30.105940,https://placekitten.com/373/320,0.0,m
2,3,Jeanice,Aleman,jeanice.aleman392@hotmail.com,NaN,2016-08-02 16:11:09.542004,https://placekitten.com/238/264,0.0,f
3,4,Tamala,Polhamus,tamala.polhamus146@aol.com,NaN,2016-08-02 18:02:40.389299,https://placekitten.com/220/223,0.0,f
4,5,Alethea,Gubler,alethea.gubler708@aol.com,NaN,2016-08-02 14:31:53.163034,https://placekitten.com/284/339,0.0,f

Get the number of users.  This should be the number of rows in the dataframe, assuming each user is unique:

In [99]:
users = len(df)
users

64393

In [100]:
df_users['date_joined'] = pd.to_datetime(df_users['date_joined'])

In [101]:
df_users['date'] = df_users['date_joined'].dt.date

In [102]:
df_users['date'] = pd.to_datetime(df_users['date'])

In [103]:
df_users.dtypes

id                      int64
first_name             object
last_name              object
email                  object
channel                object
date_joined    datetime64[ns]
photo                  object
fee                   float64
gender                 object
date           datetime64[ns]
dtype: object

### Number of users before 02-03-2018

In [104]:
len(df_users[df_users['date'] < '2018-02-03'])

35826

### Read in the dataframe for all pets

In [116]:
df_pets = pd.read_csv('csvs/pets_pet.csv')

In [121]:
df_pets.head()

,id,name,description,gender,weight,birthday,plays_cats,plays_children,plays_dogs,spayed_neutered,house_trained,size,owner_id
0,1,Jammie,Morbi fames a mauris elit malesuada platea.,f,76,2016-05-26,1,1,1,1,1,large,12601
1,2,Lonnie,Class magna a libero felis sociosqu.,f,12,2014-05-20,0,1,1,1,0,small,12602
2,3,Emely,Felis class.,m,11,2014-08-21,0,1,1,1,0,small,12602
3,4,Emelia,Fames class egestas mollis risus posuere.,f,35,2013-09-23,1,1,1,0,0,medium,12603
4,5,Jami,Netus augue a congue orci.,m,35,2014-05-13,0,1,1,1,1,medium,12603

In [117]:
#these are the number of unique owner_ids among all the pets listed
unique_pets = len(df_pets['owner_id'].unique())

In [118]:
unique_pets/users #percent of all users who have pets

0.804326557234482

In [120]:
len(df_pets)/unique_pets #number of pets per unique user

1.500781958951982

In [127]:
num_plays_cats = df_pets['plays_cats'].sum()

In [128]:
num_plays_cats/len(df_pets) #percent of pets that play well with cats

0.24850122217933873